USE `letrak`
;

ALTER TABLE `parousia` CHANGE `adidos` `adidos` ENUM('ΚΑΝΟΝΙΚΗ','ΚΑΝΟΝΙΚΗ (ΜΕΤΑΦΟΡΑ)','ΤΗΛΕΡΓΑΣΙΑ','ΑΣΘΕΝΕΙΑ','ΑΝΑΡΡΩΤΙΚΗ','ΑΣΘΕΝΕΙΑ TEKNOY','ΓΟΝΙΚΗ ΣΧΟΛ. ΕΠΙΔ.','ΓΟΝΙΚΗ ΑΝΑΤΡΟΦΗΣ','ΚΥΗΣΕΩΣ & ΛΟΧΕΙΑΣ','ΡΕΠΟ ΑΙΜΟΔΟΣΙΑΣ','ΡΕΠΟ ΥΠΕΡΩΡΙΑΣ','ΡΕΠΟ ΑΝΑΠΑΥΣΗΣ','ΣΕΜΙΝΑΡΙΟ','ΣΠΟΥΔΑΣΤΙΚΗ','ΣΥΝΔΙΚΑΛΙΣΤΙΚΗ','ΓΑΜΟΥ','ΠΕΝΘΟΥΣ','ΕΚΛΟΓΙΚΗ','ΑΘΛΗΤΙΚΗ','ΔΙΚΑΣΤΗΡΙΟ','ΣΤΡΑΤΙΩΤΙΚΗ','ΕΙΔΙΚΗ ΑΔΕΙΑ','ΑΠΕΡΓΙΑ','ΑΝΕΥ ΑΠΟΔΟΧΩΝ','ΔΙΑΘΕΣΙΜΟΤΗΤΑ','ΑΡΓΙΑ','ΛΥΣΗ ΣΧ. ΕΡΓΑΣΙΑΣ','ΜΕΤΑΚΙΝΗΣΗ') CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT 'Είδος αδείας';
