USE `letrak`
;

ALTER TABLE `parousia` CHANGE `adidos` `adidos` ENUM('ΚΑΝΟΝΙΚΗ','ΚΑΝΟΝΙΚΗ (ΜΕΤΑΦΟΡΑ)','ΤΗΛΕΡΓΑΣΙΑ','ΑΝΑΡΡΩΤΙΚΗ','ΑΣΘΕΝΕΙΑ ΤΕΚΝΟΥ','ΓΟΝΙΚΗ ΣΧΟΛ. ΕΠΙΔ.','ΓΟΝΙΚΗ ΑΝΑΤΡΟΦΗΣ','ΚΥΗΣΕΩΣ & ΛΟΧΕΙΑΣ','ΡΕΠΟ ΑΙΜΟΔΟΣΙΑΣ','ΡΕΠΟ ΥΠΕΡΩΡΙΑΣ','ΡΕΠΟ ΑΝΑΠΑΥΣΗΣ','ΣΕΜΙΝΑΡΙΟ','ΣΠΟΥΔΑΣΤΙΚΗ','ΣΥΝΔΙΚΑΛΙΣΤΙΚΗ','ΓΑΜΟΥ','ΠΕΝΘΟΥΣ','ΕΚΛΟΓΙΚΗ','ΑΘΛΗΤΙΚΗ','ΔΙΚΑΣΤΗΡΙΟ','ΣΤΡΑΤΙΩΤΙΚΗ','ΕΙΔΙΚΗ ΑΔΕΙΑ','ΑΠΕΡΓΙΑ','ΑΝΕΥ ΑΠΟΔΟΧΩΝ','ΔΙΑΘΕΣΙΜΟΤΗΤΑ','ΑΡΓΙΑ','ΛΥΣΗ ΣΧ. ΕΡΓΑΣΙΑΣ','ΜΕΤΑΚΙΝΗΣΗ','ΑΣΘΕΝΕΙΑ','ΣΥΜΠΛΗΡΩΣΗ ΩΡΑΡΙΟΥ','ΑΙΜΟΔΟΣΙΑ','ΙΑΤΡΙΚΕΣ ΕΞΕΤΑΣΕΙΣ','ΚΑΤ'' ΟΙΚΟΝ ΠΕΡΙΟΡΙΣΜΟΣ','ΕΚ ΠΕΡΙΤΡΟΠΗΣ','ΑΠΟΣΠΑΣΗ','ΡΕΠΟ ΔΗΜΑΡΧΟΥ','ΕΚΤΟΣ ΕΔΡΑΣ','ΕΣΩΤΕΡΙΚΗ ΔΙΑΘΕΣΗ','ΡΕΠΟ ΕΦΟΡΕΥΤΙΚΗΣ') CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT 'Είδος αδείας';
