USE `letrak`
;

ALTER TABLE `parousia`
MODIFY COLUMN `adidos`	ENUM (
	'ΚΑΝΟΝΙΚΗ',
	'ΚΑΝΟΝΙΚΗ (ΜΕΤΑΦΟΡΑ)',
	'ΤΗΛΕΡΓΑΣΙΑ',
	'ΕΚ ΠΕΡΙΤΡΟΠΗΣ',
	'ΑΡΘΡΟ 55',

	'ΑΣΘΕΝΕΙΑ',
	'ΑΝΑΡΡΩΤΙΚΗ',
	'ΑΣΘΕΝΕΙΑ ΤΕΚΝΟΥ',
	'ΑΙΜΟΔΟΣΙΑ',
	'ΚΑΤ\' ΟΙΚΟΝ ΠΕΡΙΟΡΙΣΜΟΣ',
	'ΙΑΤΡΙΚΕΣ ΕΞΕΤΑΣΕΙΣ',

	'ΓΟΝΙΚΗ ΣΧΟΛ. ΕΠΙΔ.',
	'ΓΟΝΙΚΗ ΑΝΑΤΡΟΦΗΣ',
	'ΚΥΗΣΕΩΣ & ΛΟΧΕΙΑΣ',

	'ΡΕΠΟ ΑΙΜΟΔΟΣΙΑΣ',
	'ΡΕΠΟ ΥΠΕΡΩΡΙΑΣ',
	'ΡΕΠΟ ΑΝΑΠΑΥΣΗΣ',
	'ΡΕΠΟ ΔΗΜΑΡΧΟΥ',
	'ΡΕΠΟ ΕΦΟΡΕΥΤΙΚΗΣ',
	'ΣΥΜΠΛΗΡΩΣΗ ΩΡΑΡΙΟΥ',

	'ΕΙΔΙΚΗ ΑΔΕΙΑ',
	'ΣΕΜΙΝΑΡΙΟ',
	'ΣΠΟΥΔΑΣΤΙΚΗ',
	'ΣΥΝΔΙΚΑΛΙΣΤΙΚΗ',
	'ΓΑΜΟΥ',
	'ΠΕΝΘΟΥΣ',
	'ΕΚΛΟΓΙΚΗ',
	'ΑΘΛΗΤΙΚΗ',
	'ΔΙΚΑΣΤΗΡΙΟ',
	'ΣΤΡΑΤΙΩΤΙΚΗ',

	'ΕΚΤΟΣ ΕΔΡΑΣ',
	'ΕΣΩΤΕΡΙΚΗ ΔΙΑΘΕΣΗ',
	'ΑΠΕΡΓΙΑ',
	'ΑΝΕΥ ΑΠΟΔΟΧΩΝ',
	'ΑΠΟΣΠΑΣΗ',
	'ΔΙΑΘΕΣΙΜΟΤΗΤΑ',
	'ΑΡΓΙΑ',
	'ΛΥΣΗ ΣΧ. ΕΡΓΑΣΙΑΣ',
	'ΜΕΤΑΚΙΝΗΣΗ'
) NULL DEFAULT NULL COMMENT 'Είδος αδείας';
