///////////////////////////////////////////////////////////////////////////////@
//
// @BEGIN
//
// @COPYRIGHT BEGIN
// Copyright (C) 2020 Panos I. Papadopoulos <panos1962_AT_gmail_DOT_com>
// @COPYRIGHT END
//
// @FILETYPE BEGIN
// javascript
// @FILETYPE END
//
// @FILE BEGIN
// www/prosopa/ektiposi.js —— Πρόγραμμα εκτύπωσης διαφορών παρουσιολογίων
// @FILE END
//
// @DESCRIPTION BEGIN
// @DESCRIPTION END
//
// @HISTORY BEGIN
// Created: 2022-09-17
// @HISTORY END
//
// @END
//
///////////////////////////////////////////////////////////////////////////////@

"use strict";

module.exports = function(pnd, letrak, diafores) {
const ektiposi = {};

///////////////////////////////////////////////////////////////////////////////@

// Η εκτύπωση του δελτίου προσέλευσης/αποχώρησης δημιουργείται ως DOM κόμβος
// της βασικής δελίδας επεξεργασίας λεπτομερειών του δελτίου. Ο συγκεκριμένος
// κόμβος δημιουργείται άπαξ κατά το στήσιμο της σελίδας και «γεμίζει» κάθε
// φορά που ο χρήστης δρομολογεί εκτύπωση δελτίου προσέλευσης/αποχώρησης ή
// δελτίου απόντων.

ektiposi.setup = () => {
	ektiposi.bodyDOM = $('<div>').
	attr('id', 'ektiposi').
	appendTo(pnd.bodyDOM);

	ektiposi.reset();
	return ektiposi;
};

// Η function "before" καλείται αμέσως μετά τη δρομολόγηση εκτύπωσης του
// δελτίου από τον χρήστη και πριν αρχίσει να δημιουργείται το περιεχόμενο
// του κόμβου εκτύπωσης, επομένως είναι το σωστό σημείο να λάβουν χώρα οι
// απαραίτητες εργασίες προετοιμασίας.

ektiposi.before = () => {
	return ektiposi;
};

// Η function "after" καλείται μετά το πέρας ή την ακύρωση της εκτύπωσης
// και σκοπό έχει να «αδειάσει» τον κόμβο εκτύπωσης και να επαναφέρει τις
// διαδικασίες εκτύπωσης στις default διαδικασίες εκτύπωσης δελτίου.

ektiposi.after = () => {
	return ektiposi;
};

// Σε γενικές γραμμές τα διάφορα εκτυπωτικά του δελτίου μοιάζουν μεταξύ τους.
// Ωστόσο σε αρκετά σημεία υπάρχουν διαφοροποιήσεις οι οποίες έχουν απομονωθεί
// σε functions (dirvers) που τίθενται κατά τη διαδικασία επιλογής εκτύπωσης
// από τον χρήστη. Η function "reset" θέτει ή επαναφέρει τους drivers στους
// default drivers εκτύπωσης δελτίου.

ektiposi.reset = () => {
	return ektiposi;
};

///////////////////////////////////////////////////////////////////////////////@

return ektiposi;
};
